Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/multiprotocol/ble_zigbee_light_prov_wbz450/firmware/src/packs/WBZ450_DFP/component/fuses.h
#define FUSES_DEVCFG4_DSWDTPS_DSPS28          (FUSES_DEVCFG4_DSWDTPS_DSPS28_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:2^28(2.4 hours) Position  */
#define FUSES_DEVCFG4_DSWDTPS_DSPS29          (FUSES_DEVCFG4_DSWDTPS_DSPS29_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:2^29(4.8 hours) Position  */
#define FUSES_DEVCFG4_DSWDTPS_DSPS30          (FUSES_DEVCFG4_DSWDTPS_DSPS30_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:2^30(9.6 hours) Position  */
#define FUSES_DEVCFG4_DSWDTPS_DSPS31          (FUSES_DEVCFG4_DSWDTPS_DSPS31_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:2^31(19.2 hours) Position  */
#define FUSES_DEVCFG4_DSWDTPS_DSPS32          (FUSES_DEVCFG4_DSWDTPS_DSPS32_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:2^32(38.5 hours) Position  */
#define FUSES_DEVCFG4_DSWDTPS_DSPS33          (FUSES_DEVCFG4_DSWDTPS_DSPS33_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:2^33(77.0 hours) Position  */
#define FUSES_DEVCFG4_DSWDTPS_DSPS34          (FUSES_DEVCFG4_DSWDTPS_DSPS34_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:2^34(6.4 days) Position  */
#define FUSES_DEVCFG4_DSWDTPS_DSPS35          (FUSES_DEVCFG4_DSWDTPS_DSPS35_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:2^35(12.8 days) Position  */
#define FUSES_DEVCFG4_DSWDTPS_DSPS36          (FUSES_DEVCFG4_DSWDTPS_DSPS36_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:2^36(25.7 days) Position  */
#define FUSES_DEVCFG4_DSWDTOSC_Pos            _UINT32_(26)                                         /* (FUSES_DEVCFG4) Deep Sleep Watchdog Timer Reference Clock Select Position */
#define FUSES_DEVCFG4_DSWDTOSC_Msk            (_UINT32_(0x1) << FUSES_DEVCFG4_DSWDTOSC_Pos)        /* (FUSES_DEVCFG4) Deep Sleep Watchdog Timer Reference Clock Select Mask */
#define FUSES_DEVCFG4_DSWDTOSC(value)         (FUSES_DEVCFG4_DSWDTOSC_Msk & (_UINT32_(value) << FUSES_DEVCFG4_DSWDTOSC_Pos)) /* Assigment of value for DSWDTOSC in the FUSES_DEVCFG4 register */
#define   FUSES_DEVCFG4_DSWDTOSC_SOSC_Val     _UINT32_(0x0)                                        /* (FUSES_DEVCFG4) Select SOSC as DSWDT Reference Clock  */
#define   FUSES_DEVCFG4_DSWDTOSC_LPRC_Val     _UINT32_(0x1)                                        /* (FUSES_DEVCFG4) Select LPRC as DSWDT Reference Clock  */
#define FUSES_DEVCFG4_DSWDTOSC_SOSC           (FUSES_DEVCFG4_DSWDTOSC_SOSC_Val << FUSES_DEVCFG4_DSWDTOSC_Pos) /* (FUSES_DEVCFG4) Select SOSC as DSWDT Reference Clock Position  */
#define FUSES_DEVCFG4_DSWDTOSC_LPRC           (FUSES_DEVCFG4_DSWDTOSC_LPRC_Val << FUSES_DEVCFG4_DSWDTOSC_Pos) /* (FUSES_DEVCFG4) Select LPRC as DSWDT Reference Clock Position  */
#define FUSES_DEVCFG4_DSWDTEN_Pos             _UINT32_(27)                                         /* (FUSES_DEVCFG4) Deep Sleep Watchdog Timer Enable Position */
#define FUSES_DEVCFG4_DSWDTEN_Msk             (_UINT32_(0x1) << FUSES_DEVCFG4_DSWDTEN_Pos)         /* (FUSES_DEVCFG4) Deep Sleep Watchdog Timer Enable Mask */
#define FUSES_DEVCFG4_DSWDTEN(value)          (FUSES_DEVCFG4_DSWDTEN_Msk & (_UINT32_(value) << FUSES_DEVCFG4_DSWDTEN_Pos)) /* Assigment of value for DSWDTEN in the FUSES_DEVCFG4 register */
#define   FUSES_DEVCFG4_DSWDTEN_ON_Val        _UINT32_(0x1)                                        /* (FUSES_DEVCFG4) Enabled  */
#define   FUSES_DEVCFG4_DSWDTEN_OFF_Val       _UINT32_(0x0)                                        /* (FUSES_DEVCFG4) Disabled  */
#define FUSES_DEVCFG4_DSWDTEN_ON              (FUSES_DEVCFG4_DSWDTEN_ON_Val << FUSES_DEVCFG4_DSWDTEN_Pos) /* (FUSES_DEVCFG4) Enabled Position  */
#define FUSES_DEVCFG4_DSWDTEN_OFF             (FUSES_DEVCFG4_DSWDTEN_OFF_Val << FUSES_DEVCFG4_DSWDTEN_Pos) /* (FUSES_DEVCFG4) Disabled Position  */
#define FUSES_DEVCFG4_DSEN_Pos                _UINT32_(28)                                         /* (FUSES_DEVCFG4) Deep Sleep Bit Enable Position */
#define FUSES_DEVCFG4_DSEN_Msk                (_UINT32_(0x1) << FUSES_DEVCFG4_DSEN_Pos)            /* (FUSES_DEVCFG4) Deep Sleep Bit Enable Mask */
#define FUSES_DEVCFG4_DSEN(value)             (FUSES_DEVCFG4_DSEN_Msk & (_UINT32_(value) << FUSES_DEVCFG4_DSEN_Pos)) /* Assigment of value for DSEN in the FUSES_DEVCFG4 register */
#define   FUSES_DEVCFG4_DSEN_ON_Val           _UINT32_(0x1)                                        /* (FUSES_DEVCFG4) Enable DS Bit in DSCON  */
#define   FUSES_DEVCFG4_DSEN_OFF_Val          _UINT32_(0x0)                                        /* (FUSES_DEVCFG4) Disable DS Bit in DSCON  */
#define FUSES_DEVCFG4_DSEN_ON                 (FUSES_DEVCFG4_DSEN_ON_Val << FUSES_DEVCFG4_DSEN_Pos) /* (FUSES_DEVCFG4) Enable DS Bit in DSCON Position  */
#define FUSES_DEVCFG4_DSEN_OFF                (FUSES_DEVCFG4_DSEN_OFF_Val << FUSES_DEVCFG4_DSEN_Pos) /* (FUSES_DEVCFG4) Disable DS Bit in DSCON Position  */
#define FUSES_DEVCFG4_UVREGROVR_Pos           _UINT32_(29)                                         /* (FUSES_DEVCFG4) ULPVREG Retention Mode Override Position */
#define FUSES_DEVCFG4_UVREGROVR_Msk           (_UINT32_(0x1) << FUSES_DEVCFG4_UVREGROVR_Pos)       /* (FUSES_DEVCFG4) ULPVREG Retention Mode Override Mask */
#define FUSES_DEVCFG4_UVREGROVR(value)        (FUSES_DEVCFG4_UVREGROVR_Msk & (_UINT32_(value) << FUSES_DEVCFG4_UVREGROVR_Pos)) /* Assigment of value for UVREGROVR in the FUSES_DEVCFG4 register */
#define   FUSES_DEVCFG4_UVREGROVR_FORCED_Val  _UINT32_(0x1)                                        /* (FUSES_DEVCFG4) ULPVREG forced in retention mode  */
#define   FUSES_DEVCFG4_UVREGROVR_CONTROLLED_Val _UINT32_(0x0)                                        /* (FUSES_DEVCFG4) ULPVREG controlled by XDS/DS FSM  */
#define FUSES_DEVCFG4_UVREGROVR_FORCED        (FUSES_DEVCFG4_UVREGROVR_FORCED_Val << FUSES_DEVCFG4_UVREGROVR_Pos) /* (FUSES_DEVCFG4) ULPVREG forced in retention mode Position  */
#define FUSES_DEVCFG4_UVREGROVR_CONTROLLED    (FUSES_DEVCFG4_UVREGROVR_CONTROLLED_Val << FUSES_DEVCFG4_UVREGROVR_Pos) /* (FUSES_DEVCFG4) ULPVREG controlled by XDS/DS FSM Position  */
#define FUSES_DEVCFG4_RTCNTM_CSEL_Pos         _UINT32_(31)                                         /* (FUSES_DEVCFG4) RTC Counter Mode Clock Select Position */
#define FUSES_DEVCFG4_RTCNTM_CSEL_Msk         (_UINT32_(0x1) << FUSES_DEVCFG4_RTCNTM_CSEL_Pos)     /* (FUSES_DEVCFG4) RTC Counter Mode Clock Select Mask */
#define FUSES_DEVCFG4_RTCNTM_CSEL(value)      (FUSES_DEVCFG4_RTCNTM_CSEL_Msk & (_UINT32_(value) << FUSES_DEVCFG4_RTCNTM_CSEL_Pos)) /* Assigment of value for RTCNTM_CSEL in the FUSES_DEVCFG4 register */
#define   FUSES_DEVCFG4_RTCNTM_CSEL_RAW_Val   _UINT32_(0x1)                                        /* (FUSES_DEVCFG4) Raw 32kHz clock  */
#define   FUSES_DEVCFG4_RTCNTM_CSEL_PROCESSED_Val _UINT32_(0x0)                                        /* (FUSES_DEVCFG4) Processed 32kHz clock  */
#define FUSES_DEVCFG4_RTCNTM_CSEL_RAW         (FUSES_DEVCFG4_RTCNTM_CSEL_RAW_Val << FUSES_DEVCFG4_RTCNTM_CSEL_Pos) /* (FUSES_DEVCFG4) Raw 32kHz clock Position  */
#define FUSES_DEVCFG4_RTCNTM_CSEL_PROCESSED   (FUSES_DEVCFG4_RTCNTM_CSEL_PROCESSED_Val << FUSES_DEVCFG4_RTCNTM_CSEL_Pos) /* (FUSES_DEVCFG4) Processed 32kHz clock Position  */
#define FUSES_DEVCFG4_Msk                     _UINT32_(0xBFFFFFFF)                                 /* (FUSES_DEVCFG4) Register Mask  */


/* -------- FUSES_DEVCFG2 : (FUSES Offset: 0x110) (R/W 32) USER Page CFGCON2 Fuses -------- */
#define FUSES_DEVCFG2_RESETVALUE              _UINT32_(0x5F74FF38)                                 /*  (FUSES_DEVCFG2) USER Page CFGCON2 Fuses  Reset Value */

