Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/multiprotocol/ble_zigbee_light_prov_wbz450/firmware/src/packs/WBZ450_DFP/component/fuses.h
/* -------- FUSES_FBCFG0 : (FUSES Offset: 0x11C) (R/W 32) NVR BCFG User Configuration Area -------- */
#define FUSES_FBCFG0_RESETVALUE               _UINT32_(0x00)                                       /*  (FUSES_FBCFG0) NVR BCFG User Configuration Area  Reset Value */

#define FUSES_FBCFG0_PCSCMODE_Pos             _UINT32_(1)                                          /* (FUSES_FBCFG0) PCache Single cache Mode Position */
#define FUSES_FBCFG0_PCSCMODE_Msk             (_UINT32_(0x1) << FUSES_FBCFG0_PCSCMODE_Pos)         /* (FUSES_FBCFG0) PCache Single cache Mode Mask */
#define FUSES_FBCFG0_PCSCMODE(value)          (FUSES_FBCFG0_PCSCMODE_Msk & (_UINT32_(value) << FUSES_FBCFG0_PCSCMODE_Pos)) /* Assigment of value for PCSCMODE in the FUSES_FBCFG0 register */
#define   FUSES_FBCFG0_PCSCMODE_SINGLE_Val    _UINT32_(0x1)                                        /* (FUSES_FBCFG0) PCHE ICache Only.CPU Instructions (code, data) go to PCHE ONLY.  */
#define   FUSES_FBCFG0_PCSCMODE_DUAL_Val      _UINT32_(0x0)                                        /* (FUSES_FBCFG0) PCHE ICache and DCache. CPU opcodes go to PCEHE ICache port and data goes to PCHE  */
#define FUSES_FBCFG0_PCSCMODE_SINGLE          (FUSES_FBCFG0_PCSCMODE_SINGLE_Val << FUSES_FBCFG0_PCSCMODE_Pos) /* (FUSES_FBCFG0) PCHE ICache Only.CPU Instructions (code, data) go to PCHE ONLY. Position  */
#define FUSES_FBCFG0_PCSCMODE_DUAL            (FUSES_FBCFG0_PCSCMODE_DUAL_Val << FUSES_FBCFG0_PCSCMODE_Pos) /* (FUSES_FBCFG0) PCHE ICache and DCache. CPU opcodes go to PCEHE ICache port and data goes to PCHE Position  */
#define FUSES_FBCFG0_BINFOVALID_Pos           _UINT32_(31)                                         /* (FUSES_FBCFG0) BCFG info valid Position */
#define FUSES_FBCFG0_BINFOVALID_Msk           (_UINT32_(0x1) << FUSES_FBCFG0_BINFOVALID_Pos)       /* (FUSES_FBCFG0) BCFG info valid Mask */
#define FUSES_FBCFG0_BINFOVALID(value)        (FUSES_FBCFG0_BINFOVALID_Msk & (_UINT32_(value) << FUSES_FBCFG0_BINFOVALID_Pos)) /* Assigment of value for BINFOVALID in the FUSES_FBCFG0 register */
#define   FUSES_FBCFG0_BINFOVALID_NOT_VALID_Val _UINT32_(0x1)                                        /* (FUSES_FBCFG0) BCFG0 to BCFG7 is not valid.  */
#define   FUSES_FBCFG0_BINFOVALID_VALID_Val   _UINT32_(0x0)                                        /* (FUSES_FBCFG0) BCFG0 to BCFG7 is valid.  */
#define FUSES_FBCFG0_BINFOVALID_NOT_VALID     (FUSES_FBCFG0_BINFOVALID_NOT_VALID_Val << FUSES_FBCFG0_BINFOVALID_Pos) /* (FUSES_FBCFG0) BCFG0 to BCFG7 is not valid. Position  */
#define FUSES_FBCFG0_BINFOVALID_VALID         (FUSES_FBCFG0_BINFOVALID_VALID_Val << FUSES_FBCFG0_BINFOVALID_Pos) /* (FUSES_FBCFG0) BCFG0 to BCFG7 is valid. Position  */
#define FUSES_FBCFG0_Msk                      _UINT32_(0x80000002)                                 /* (FUSES_FBCFG0) Register Mask  */


/* -------- FUSES_FCPN3 : (FUSES Offset: 0x130) (R/W 32) RESERVED -------- */
#define FUSES_FCPN3_RESETVALUE                _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_FCPN3) RESERVED  Reset Value */

#define FUSES_FCPN3_Msk                       _UINT32_(0x00000000)                                 /* (FUSES_FCPN3) Register Mask  */


/* -------- FUSES_FCPN2 : (FUSES Offset: 0x134) (R/W 32) RESERVED -------- */
#define FUSES_FCPN2_RESETVALUE                _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_FCPN2) RESERVED  Reset Value */

#define FUSES_FCPN2_Msk                       _UINT32_(0x00000000)                                 /* (FUSES_FCPN2) Register Mask  */


/* -------- FUSES_FCPN1 : (FUSES Offset: 0x138) (R/W 32) RESERVED -------- */
#define FUSES_FCPN1_RESETVALUE                _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_FCPN1) RESERVED  Reset Value */

#define FUSES_FCPN1_Msk                       _UINT32_(0x00000000)                                 /* (FUSES_FCPN1) Register Mask  */


/* -------- FUSES_FCPN0 : (FUSES Offset: 0x13C) (R/W 32) NVR CPN Register -------- */
#define FUSES_FCPN0_RESETVALUE                _UINT32_(0x10000000)                                 /*  (FUSES_FCPN0) NVR CPN Register  Reset Value */

#define FUSES_FCPN0_CP_Pos                    _UINT32_(28)                                         /* (FUSES_FCPN0) Boot Code Protect Position */
#define FUSES_FCPN0_CP_Msk                    (_UINT32_(0x1) << FUSES_FCPN0_CP_Pos)                /* (FUSES_FCPN0) Boot Code Protect Mask */
#define FUSES_FCPN0_CP(value)                 (FUSES_FCPN0_CP_Msk & (_UINT32_(value) << FUSES_FCPN0_CP_Pos)) /* Assigment of value for CP in the FUSES_FCPN0 register */
#define   FUSES_FCPN0_CP_DISABLED_Val         _UINT32_(0x1)                                        /* (FUSES_FCPN0) Protection Disabled  */
#define   FUSES_FCPN0_CP_ENABLED_Val          _UINT32_(0x0)                                        /* (FUSES_FCPN0) Protection Enabled  */
#define FUSES_FCPN0_CP_DISABLED               (FUSES_FCPN0_CP_DISABLED_Val << FUSES_FCPN0_CP_Pos)  /* (FUSES_FCPN0) Protection Disabled Position  */
#define FUSES_FCPN0_CP_ENABLED                (FUSES_FCPN0_CP_ENABLED_Val << FUSES_FCPN0_CP_Pos)   /* (FUSES_FCPN0) Protection Enabled Position  */
#define FUSES_FCPN0_Msk                       _UINT32_(0x10000000)                                 /* (FUSES_FCPN0) Register Mask  */


/** \brief FUSES register offsets definitions */
#define FUSES_ALTFBCFG7_REG_OFST       _UINT32_(0x00)      /* (FUSES_ALTFBCFG7) RESERVED Offset */
#define FUSES_ALTFBCFG6_REG_OFST       _UINT32_(0x04)      /* (FUSES_ALTFBCFG6) RESERVED Offset */
#define FUSES_ALTFUSERID_REG_OFST      _UINT32_(0x08)      /* (FUSES_ALTFUSERID) ALT USERID Offset */
#define FUSES_ALTDEVCFG4_REG_OFST      _UINT32_(0x0C)      /* (FUSES_ALTDEVCFG4) ALT CFGCON4 Fuses Offset */
#define FUSES_ALTDEVCFG2_REG_OFST      _UINT32_(0x10)      /* (FUSES_ALTDEVCFG2) ALT CFGCON2 Fuses Offset */
#define FUSES_ALTDEVCFG1_REG_OFST      _UINT32_(0x14)      /* (FUSES_ALTDEVCFG1) ALT CFGCON1 Fuses Offset */
#define FUSES_ALTDEVCFG0_REG_OFST      _UINT32_(0x18)      /* (FUSES_ALTDEVCFG0) ALT CFGCON0 Fuses Offset */
#define FUSES_ALTFBCFG0_REG_OFST       _UINT32_(0x1C)      /* (FUSES_ALTFBCFG0) ALT NVR BCFG0 Offset */
#define FUSES_ALTFCPN3_REG_OFST        _UINT32_(0x30)      /* (FUSES_ALTFCPN3) RESERVED Offset */
#define FUSES_ALTFCPN2_REG_OFST        _UINT32_(0x34)      /* (FUSES_ALTFCPN2) RESERVED Offset */
#define FUSES_ALTFCPN1_REG_OFST        _UINT32_(0x38)      /* (FUSES_ALTFCPN1) RESERVED Offset */
#define FUSES_ALTFCPN0_REG_OFST        _UINT32_(0x3C)      /* (FUSES_ALTFCPN0) ALT NVR CPN Register Offset */
#define FUSES_FBCFG7_REG_OFST          _UINT32_(0x100)     /* (FUSES_FBCFG7) RESERVED Offset */
#define FUSES_FBCFG6_REG_OFST          _UINT32_(0x104)     /* (FUSES_FBCFG6) RESERVED Offset */
#define FUSES_FUSERID_REG_OFST         _UINT32_(0x108)     /* (FUSES_FUSERID) USER Page USERID Offset */
#define FUSES_DEVCFG4_REG_OFST         _UINT32_(0x10C)     /* (FUSES_DEVCFG4) USER Page CFGCON4 Fuses Offset */
#define FUSES_DEVCFG2_REG_OFST         _UINT32_(0x110)     /* (FUSES_DEVCFG2) USER Page CFGCON2 Fuses Offset */
#define FUSES_DEVCFG1_REG_OFST         _UINT32_(0x114)     /* (FUSES_DEVCFG1) USER Page CFGCON1 Fuses Offset */
#define FUSES_DEVCFG0_REG_OFST         _UINT32_(0x118)     /* (FUSES_DEVCFG0) USER Page CFGCON0 Fuses Offset */
#define FUSES_FBCFG0_REG_OFST          _UINT32_(0x11C)     /* (FUSES_FBCFG0) NVR BCFG User Configuration Area Offset */
#define FUSES_FCPN3_REG_OFST           _UINT32_(0x130)     /* (FUSES_FCPN3) RESERVED Offset */
#define FUSES_FCPN2_REG_OFST           _UINT32_(0x134)     /* (FUSES_FCPN2) RESERVED Offset */
#define FUSES_FCPN1_REG_OFST           _UINT32_(0x138)     /* (FUSES_FCPN1) RESERVED Offset */
#define FUSES_FCPN0_REG_OFST           _UINT32_(0x13C)     /* (FUSES_FCPN0) NVR CPN Register Offset */

